#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/batooney/dev-cluster/runs/run-VuEAQgCRy1zqDxt5

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e5a5cde5af208e98]
module.eks.aws_iam_policy.cluster_deny_log_group[0]: Refreshing state... [id=arn:aws:iam::691619410638:policy/dev-cluster-deny-log-group20220528194218200100000003]
module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::691619410638:policy/dev-cluster-elb-sl-role-creation20220528194218187200000002]
aws_ecr_repository.backend: Refreshing state... [id=backend]
module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=dev-cluster20220528194218186300000001]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f0f0367dbdc7bb21]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=dev-cluster20220528194218186300000001-20220528194218875700000007]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=dev-cluster20220528194218186300000001-20220528194218846900000006]
module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=dev-cluster20220528194218186300000001-20220528194218884400000008]
module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]: Refreshing state... [id=dev-cluster20220528194218186300000001-20220528194218841800000005]
module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=dev-cluster20220528194218186300000001-20220528194218838400000004]
aws_security_group.worker_group_mgmt_one: Refreshing state... [id=sg-0bc7b41a7ac300f2b]
module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-08eddc56b7b4f46e2]
aws_security_group.worker_group_mgmt_two: Refreshing state... [id=sg-0dfcc53e5a0a3ee99]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-02a66e5032b6db9cd]
aws_security_group.all_worker_mgmt: Refreshing state... [id=sg-0fc276ee6a4dee3fe]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a3efc1f898954d49]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d61cb3e4bf7b1024]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e0ea5cedf8b0ac94]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0043935c2cec5b808]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09b7c27bacd2ea7ff]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e11aa2ebf2ca43cb]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0960ef15b6d8be29b]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01699148d9ed79f87]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-063a700a4e373bc4e]
module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-1703629535]
module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-419597318]
module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-1232907012]
module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-693469742]
module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-3895543819]
module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-3788918254]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-063a700a4e373bc4e1080289494]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-03ba3f9f39a897cca]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-052120501fd2e4f79]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0be0d3535bdddd40f]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0376bc018c5b3e093]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0a0a8a05a85c65f9f]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02bdd3070e7232625]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09ff368fb4bb1d017]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=dev-cluster]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09b7c27bacd2ea7ff1080289494]
module.eks.local_file.kubeconfig[0]: Refreshing state... [id=305e06626c6d5e75ed46cb21a097017b69db3ead]
module.eks.aws_iam_role.workers[0]: Refreshing state... [id=dev-cluster2022052819522970740000000e]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=dev-cluster2022052819522970740000000e-20220528195230412900000013]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=dev-cluster2022052819522970740000000e-20220528195230369400000011]
module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=dev-cluster2022052819522970740000000e-20220528195230405400000012]
module.eks.aws_iam_instance_profile.workers[0]: Refreshing state... [id=dev-cluster2022052819523032940000000f]
module.eks.aws_iam_instance_profile.workers[1]: Refreshing state... [id=dev-cluster20220528195230332800000010]
module.eks.aws_launch_configuration.workers[0]: Refreshing state... [id=dev-cluster-worker-group-120220528195230534400000015]
module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_launch_configuration.workers[1]: Refreshing state... [id=dev-cluster-worker-group-220220528195230526700000014]
module.eks.aws_autoscaling_group.workers[0]: Refreshing state... [id=dev-cluster-worker-group-120220528195248568300000017]
module.eks.aws_autoscaling_group.workers[1]: Refreshing state... [id=dev-cluster-worker-group-220220528195248559000000016]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://3DF3950449DCB7017B2F15BED07268D9.gr7.us-west-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1EVXlPREU1TkRnek1Gb1hEVE15TURVeU5URTVORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTkI0CkhITElacXYrTEtsdEJNWjFkemN5a2pnWjRyeEM1VHFRSk1nQXZieVRreWtaRVhHRlJvY3F2UktPQXk5ZVpuakQKT3BQR0lVWGQ2aS9SR0ZNU2pzYVVTMHJuV0U3VUMxenZyYkFET2FLcDlPRzJYWkZXUU5XT0I0QUt1elFKOGs1dQpIdEdmQ0tLTnFyaXd6cVVDSk9jUGtKL2VvZnZwSm11L3BjVUpUZDgxajEycEF1R2xoN1JmajBEQkZ0YVo5ampQCmVldWgwVFNBSTdtcTdIcTVrSWFyM0Q3Y2UxUnZ6Ung0V3NSQWF1dVlSNElyZnBMOHNEQjdmQm1qR25ndHpkVGcKeGkwVzBHeW9rOFczdnpxWGZhamVuV1RVc0pBb3VrUklwVFBaYWdEU2hWWmNkdjYwSlV1cXFKRmxXUkp4UllaMQpKZDQ2Um5tbGhVVk1ueG1NeHNFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLOFV3QUQzTmwvRk11SnNCS0xoUHZyV1krcWxNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFETUVHMHQ5TFNNL0YvUXBVcG9CMUtocEdsN3BGUzcwYm1kN3dVNWJwbmFiSVZGR2poLwo5RllkeE1QTVBRbHVSSVZWeThtQ0RReW83NmNwczRRRklHVkR3ZXVjd24rdFZ6dDVlbTB3NllwalBDTXdjZFMxCng1azd5ckE0WUdBTHBIWllvc0NwN0RGZFk3dVc4alE0d2ExTTJJZDZTQW43cXIzZGlDRU16YThGbEY0M0dodUEKbkwwMi9TMzc4Y2pPLzM4N1dnNmhsT3F4L3JxY2FxNjJ5L0lqQWJLaDhWUWRJNlcwTmxXRms0d1h5alZGYzFtagpqd2V2cXArZFF6Ty9sdzdwbGwzWjZ4RGNweGc5UHVsdDVKaWhzYjlnbnlhbUNrd3gvaWEvUjVvZmg2Q2wxNktrCjBVTDhMNkwxNkxwT2E2bnVSbFpSdzdudm8zSkF3Z2ZjZUdkKwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_dev-cluster
            
            contexts:
            - context:
                cluster: eks_dev-cluster
                user: eks_dev-cluster
              name: eks_dev-cluster
            
            current-context: eks_dev-cluster
            
            users:
            - name: eks_dev-cluster
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "dev-cluster"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_dev-cluster" -> null
      - id                   = "305e06626c6d5e75ed46cb21a097017b69db3ead" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.http.wait_for_cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "wait_for_cluster"  {
      ~ body             = "ok" -> (known after apply)
      ~ id               = "https://3DF3950449DCB7017B2F15BED07268D9.gr7.us-west-2.eks.amazonaws.com/healthz" -> (known after apply)
      - insecure         = false -> null
      ~ response_headers = {
          - "Cache-Control"                     = "no-cache, private"
          - "Content-Length"                    = "2"
          - "Content-Type"                      = "text/plain; charset=utf-8"
          - "Date"                              = "Mon, 30 May 2022 05:25:44 GMT"
          - "X-Content-Type-Options"            = "nosniff"
          - "X-Kubernetes-Pf-Flowschema-Uid"    = "447e2112-e5aa-4a91-af6a-7aa6254bc7d4"
          - "X-Kubernetes-Pf-Prioritylevel-Uid" = "97fb994a-d3a2-435a-94c6-ecbd6e7343a6"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "dev-cluster-worker-group-120220528195248568300000017"
      ~ launch_configuration      = "dev-cluster-worker-group-120220528195230534400000015" -> (known after apply)
        name                      = "dev-cluster-worker-group-120220528195248568300000017"
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_autoscaling_group.workers[1] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        id                        = "dev-cluster-worker-group-220220528195248559000000016"
      ~ launch_configuration      = "dev-cluster-worker-group-220220528195230526700000014" -> (known after apply)
        name                      = "dev-cluster-worker-group-220220528195248559000000016"
        # (23 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                        = "dev-cluster"
        name                      = "dev-cluster"
        tags                      = {}
        # (11 unchanged attributes hidden)



      ~ vpc_config {
          ~ endpoint_private_access   = false -> true
            # (6 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-west-2:691619410638:launchConfiguration:4bf943c6-73da-4b07-bfa2-c255d9d55ce7:launchConfigurationName/dev-cluster-worker-group-120220528195230534400000015" -> (known after apply)
      ~ id                               = "dev-cluster-worker-group-120220528195230534400000015" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "dev-cluster-worker-group-120220528195230534400000015" -> (known after apply)
      ~ security_groups                  = [ # forces replacement
          + "sg-0fc276ee6a4dee3fe",
            # (2 unchanged elements hidden)
        ]
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.aws_launch_configuration.workers[1] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-west-2:691619410638:launchConfiguration:cd4c4abe-5913-4fa2-b720-e20574b512f3:launchConfigurationName/dev-cluster-worker-group-220220528195230526700000014" -> (known after apply)
      ~ id                               = "dev-cluster-worker-group-220220528195230526700000014" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "dev-cluster-worker-group-220220528195230526700000014" -> (known after apply)
      ~ security_groups                  = [ # forces replacement
          + "sg-0fc276ee6a4dee3fe",
            # (2 unchanged elements hidden)
        ]
      - vpc_classic_link_security_groups = [] -> null
        # (8 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ metadata_options {
          ~ http_put_response_hop_limit = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ root_block_device {
          ~ throughput            = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # module.eks.kubernetes_config_map.aws_auth[0] will be updated in-place
  ~ resource "kubernetes_config_map" "aws_auth" {
      ~ data        = {
          ~ "mapAccounts" = <<-EOT
              - []
              + - "691619410638"
            EOT
          ~ "mapUsers"    = <<-EOT
              - []
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::691619410638:user/aviral"
              +   "username": "aviral"
              + - "groups":
              +   - "system:masters"
              +   "userarn": "arn:aws:iam::691619410638:user/aakash"
              +   "username": "aakash"
            EOT
            # (1 unchanged element hidden)
        }
        id          = "kube-system/aws-auth"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://3DF3950449DCB7017B2F15BED07268D9.gr7.us-west-2.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1EVXlPREU1TkRnek1Gb1hEVE15TURVeU5URTVORGd6TUZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTkI0CkhITElacXYrTEtsdEJNWjFkemN5a2pnWjRyeEM1VHFRSk1nQXZieVRreWtaRVhHRlJvY3F2UktPQXk5ZVpuakQKT3BQR0lVWGQ2aS9SR0ZNU2pzYVVTMHJuV0U3VUMxenZyYkFET2FLcDlPRzJYWkZXUU5XT0I0QUt1elFKOGs1dQpIdEdmQ0tLTnFyaXd6cVVDSk9jUGtKL2VvZnZwSm11L3BjVUpUZDgxajEycEF1R2xoN1JmajBEQkZ0YVo5ampQCmVldWgwVFNBSTdtcTdIcTVrSWFyM0Q3Y2UxUnZ6Ung0V3NSQWF1dVlSNElyZnBMOHNEQjdmQm1qR25ndHpkVGcKeGkwVzBHeW9rOFczdnpxWGZhamVuV1RVc0pBb3VrUklwVFBaYWdEU2hWWmNkdjYwSlV1cXFKRmxXUkp4UllaMQpKZDQ2Um5tbGhVVk1ueG1NeHNFQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZLOFV3QUQzTmwvRk11SnNCS0xoUHZyV1krcWxNQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFETUVHMHQ5TFNNL0YvUXBVcG9CMUtocEdsN3BGUzcwYm1kN3dVNWJwbmFiSVZGR2poLwo5RllkeE1QTVBRbHVSSVZWeThtQ0RReW83NmNwczRRRklHVkR3ZXVjd24rdFZ6dDVlbTB3NllwalBDTXdjZFMxCng1azd5ckE0WUdBTHBIWllvc0NwN0RGZFk3dVc4alE0d2ExTTJJZDZTQW43cXIzZGlDRU16YThGbEY0M0dodUEKbkwwMi9TMzc4Y2pPLzM4N1dnNmhsT3F4L3JxY2FxNjJ5L0lqQWJLaDhWUWRJNlcwTmxXRms0d1h5alZGYzFtagpqd2V2cXArZFF6Ty9sdzdwbGwzWjZ4RGNweGc5UHVsdDVKaWhzYjlnbnlhbUNrd3gvaWEvUjVvZmg2Q2wxNktrCjBVTDhMNkwxNkxwT2E2bnVSbFpSdzdudm8zSkF3Z2ZjZUdkKwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_dev-cluster
            
            contexts:
            - context:
                cluster: eks_dev-cluster
                user: eks_dev-cluster
              name: eks_dev-cluster
            
            current-context: eks_dev-cluster
            
            users:
            - name: eks_dev-cluster
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "dev-cluster"
        EOT
      + directory_permission = "0755"
      + file_permission      = "0600"
      + filename             = "./kubeconfig_dev-cluster"
      + id                   = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0f0f0367dbdc7bb21"
      ~ tags                 = {
          ~ "Name"                              = "education-vpc-us-west-2a" -> "batooney-vpc-us-west-2a"
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          ~ "Name"                              = "education-vpc-us-west-2a" -> "batooney-vpc-us-west-2a"
            # (1 unchanged element hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-0a3efc1f898954d49"
      ~ tags     = {
          ~ "Name"                              = "education-vpc" -> "batooney-vpc"
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          ~ "Name"                              = "education-vpc" -> "batooney-vpc"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-09ff368fb4bb1d017"
      ~ tags                 = {
          ~ "Name"                              = "education-vpc-us-west-2a" -> "batooney-vpc-us-west-2a"
            # (1 unchanged element hidden)
        }
      ~ tags_all             = {
          ~ "Name"                              = "education-vpc-us-west-2a" -> "batooney-vpc-us-west-2a"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-09b7c27bacd2ea7ff"
      ~ tags             = {
          ~ "Name"                              = "education-vpc-private" -> "batooney-vpc-private"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Name"                              = "education-vpc-private" -> "batooney-vpc-private"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-063a700a4e373bc4e"
      ~ tags             = {
          ~ "Name"                              = "education-vpc-public" -> "batooney-vpc-public"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Name"                              = "education-vpc-public" -> "batooney-vpc-public"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0e0ea5cedf8b0ac94"
      ~ tags                                           = {
          ~ "Name"                              = "education-vpc-private-us-west-2a" -> "batooney-vpc-private-us-west-2a"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                              = "education-vpc-private-us-west-2a" -> "batooney-vpc-private-us-west-2a"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0d61cb3e4bf7b1024"
      ~ tags                                           = {
          ~ "Name"                              = "education-vpc-private-us-west-2b" -> "batooney-vpc-private-us-west-2b"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                              = "education-vpc-private-us-west-2b" -> "batooney-vpc-private-us-west-2b"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0043935c2cec5b808"
      ~ tags                                           = {
          ~ "Name"                              = "education-vpc-private-us-west-2c" -> "batooney-vpc-private-us-west-2c"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                              = "education-vpc-private-us-west-2c" -> "batooney-vpc-private-us-west-2c"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0e11aa2ebf2ca43cb"
      ~ tags                                           = {
          ~ "Name"                              = "education-vpc-public-us-west-2a" -> "batooney-vpc-public-us-west-2a"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                              = "education-vpc-public-us-west-2a" -> "batooney-vpc-public-us-west-2a"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0960ef15b6d8be29b"
      ~ tags                                           = {
          ~ "Name"                              = "education-vpc-public-us-west-2b" -> "batooney-vpc-public-us-west-2b"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                              = "education-vpc-public-us-west-2b" -> "batooney-vpc-public-us-west-2b"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01699148d9ed79f87"
      ~ tags                                           = {
          ~ "Name"                              = "education-vpc-public-us-west-2c" -> "batooney-vpc-public-us-west-2c"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                                       = {
          ~ "Name"                              = "education-vpc-public-us-west-2c" -> "batooney-vpc-public-us-west-2c"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0e5a5cde5af208e98"
      ~ tags                             = {
          ~ "Name"                              = "education-vpc" -> "batooney-vpc"
            # (1 unchanged element hidden)
        }
      ~ tags_all                         = {
          ~ "Name"                              = "education-vpc" -> "batooney-vpc"
            # (1 unchanged element hidden)
        }
        # (15 unchanged attributes hidden)
    }

Plan: 3 to add, 16 to change, 2 to destroy.

Changes to Outputs:
  ~ config_map_aws_auth = [
      ~ {
          ~ data        = {
              ~ "mapAccounts" = <<-EOT
                  - []
                  + - "691619410638"
                EOT
              ~ "mapUsers"    = <<-EOT
                  - []
                  + - "groups":
                  +   - "system:masters"
                  +   "userarn": "arn:aws:iam::691619410638:user/aviral"
                  +   "username": "aviral"
                  + - "groups":
                  +   - "system:masters"
                  +   "userarn": "arn:aws:iam::691619410638:user/aakash"
                  +   "username": "aakash"
                EOT
                # (1 unchanged element hidden)
            }
            id          = "kube-system/aws-auth"
            # (2 unchanged elements hidden)
        },
    ]

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 8 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @aviralmansingka, Action: `pull_request`*